{"id": 1, "expected": 50, "text": "Problem 1\nProblem: Alice and Bob are each holding some integer number of sweets. Alice says to Bob: “If\nwe each added the number of sweets we’re holding to our (positive integer) age, my answer would\nbe double yours. If we took the product, then my answer would be four times yours.” Bob replies:\n“Why don’t you give me five of your sweets because then both our sum and product would be equal.”\nWhat is the product of Alice and Bob’s ages?"}
{"id": 2, "expected": 520, "text": "Problem 2\nProblem: A 500 × 500 square is divided intok rectangles, each having integer side lengths. Given\nthat no two of these rectangles have the same perimeter, the largest possible value ofk is K. What\nis the remainder whenK is divided by105?"}
{"id": 3, "expected": 336, "text": "Problem 3\nProblem: Let ABC be an acute-angled triangle with integer side lengths andAB < AC. Points\nD and E lie on segmentsBC and AC, respectively, such thatAD = AE = AB. LineDE intersects\nAB at X. Circles BXD and CED intersect for the second time atY ̸= D. Suppose that Y lies\non lineAD. There is a unique such triangle with minimal perimeter. This triangle has side lengths\na = BC, b = CA, andc = AB. Find the remainder whenabc is divided by105."}
{"id": 4, "expected": 580, "text": "Problem 4\nProblem: Let f : Z≥1 → Z≥1 be a function such that for all positive integersm and n,\nf(m) + f(n) = f(m + n + mn).\nAcross all functionsf such thatf(n) ≤ 1000 for alln ≤ 1000, how many different values canf(2024)\ntake?"}
{"id": 5, "expected": 21818, "text": "Problem 5\nProblem: A tournament is held with220 runners each of which has a different running speed. In\neach race, two runners compete against each other with the faster runner always winning the race.\nThe competition consists of20 rounds with each runner starting with a score of0. In each round,\nthe runners are paired in such a way that in each pair, both runners have the same score at the\nbeginning of the round. The winner of each race in theith round receives220−i points and the loser\ngets no points.\nAt the end of the tournament, we rank the competitors according to their scores. LetN denote the\nnumber of possible orderings of the competitors at the end of the tournament. Letk be the largest\npositive integer such that10k divides N. What is the remainder whenk is divided by105?"}
{"id": 6, "expected": 32951, "text": "Problem 6\nProblem: Define a functionf : Z≥1 → Z≥1 by\nf(n) =\nnX\ni=1\nnX\nj=1\nj1024\n\u00161\nj + n − i\nn\n\u0017\n.\nLet M = 2 · 3 · 5 · 7 · 11 · 13 and letN = f\n\u0000\nM15\u0001\n− f\n\u0000\nM15 − 1\n\u0001\n. Let k be the largest non-negative\ninteger such that2k divides N. What is the remainder when2k is divided by57?"}
{"id": 7, "expected": 57447, "text": "Problem 7\nProblem: Let ABC be a triangle withAB ̸= AC, circumcircleΩ, and incircleω. Let the contact\npoints ofω with BC, CA, andAB be D, E, andF, respectively. Let the circumcircle ofAF Emeet\nΩ at K and let the reflection ofK in EF be K′. LetN denote the foot of the perpendicular fromD\nto EF . The circle tangent to lineBN and passing throughB and K intersects BC again atT ̸= B.\nLet sequence(Fn)n≥0 be defined byF0 = 0, F1 = 1 and forn ≥ 2, Fn = Fn−1 + Fn−2. Call ABC\nn-tastic if BD = Fn, CD = Fn+1, andKNK ′B is cyclic. Across alln-tastic triangles, letan denote\nthe maximum possible value ofCT ·NB\nBT ·NE . Let α denote the smallest real number such that for all\nsufficiently largen, a2n < α. Given that α = p + √q for rationalsp and q, what is the remainder\nwhen\n\u0004\npqp \u0005\nis divided by99991?"}
{"id": 8, "expected": 32193, "text": "Problem 8\nProblem: On a blackboard, Ken starts off by writing a positive integern and then applies the\nfollowing move until he first reaches1. Given that the number on the board ism, he chooses a base\nb, where2 ≤ b ≤ m, and considers the unique base-b representation ofm,\nm =\n∞X\nk=0\nak · bk\nwhere ak are non-negative integers and0 ≤ ak < bfor eachk. Ken then erasesm on the blackboard\nand replaces it with\n∞P\nk=0\nak.\nAcross all choices of1 ≤ n ≤ 10105\n, the largest possible number of moves Ken could make isM.\nWhat is the remainder whenM is divided by105?"}
{"id": 9, "expected": 160, "text": "Problem 9\nProblem: Let F be the set of functionsα: Z → Z for which there are only finitely manyn ∈ Z\nsuch thatα(n) ̸= 0.\nFor two functionsα and β in F, define their productα ⋆ βto be P\nn∈Z\nα(n) · β(n). Also, for n ∈ Z,\ndefine a shift operatorSn : F → Fby Sn(α)(t) = α(t + n) for allt ∈ Z.\nA functionα ∈ Fis calledshifty if\n• α(m) = 0 for all integersm <0 and m >8 and\n• There existsβ ∈ Fand integersk ̸= l such that for alln ∈ Z\nSn(α) ⋆ β=\n(\n1 n ∈ {k, l}\n0 n ̸∈ {k, l} .\nHow many shifty functions are there inF?"}
{"id": 10, "expected": 8687, "text": "Problem 10\nProblem: Let n ≥ 6 be a positive integer. We call a positive integern-Norwegian if it has three\ndistinct positive divisors whose sum is equal ton. Letf(n) denote the smallestn-Norwegian positive\ninteger. Let M = 32025! and for a non-negative integerc define\ng(c) = 1\n2025!\n\u00162025!f(M + c)\nM\n\u0017\n.\nWe can write\ng(0) + g(4M) + g(1848374) + g(10162574) + g(265710644) + g(44636594) = p\nq\nwhere p and q are coprime positive integers. What is the remainder whenp + q is divided by99991?"}
